app/controllers/api/v1/coffee_controller.rb

INSERT INTO "brews" ("user_name", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_name", "noahberman"], ["location", "blakement"], ["description", "running low on beans"], ["created_at", 2016-10-17 01:29:06 UTC], ["updated_at", 2016-10-17 01:29:06 UTC]]
---
  def create
    brew = Brew.create_new_brew(params)

SELECT "brews".* FROM "brews" ORDER BY "brews"."created_at" DESC
---
  def index
    @brews = Brew.all